InformationRegisters/УчастникиСВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УчастникиСВД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяАдресата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортыСВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчастникиСВД/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Транспорт") Тогда
		Элементы.Транспорт.Видимость = Ложь;
	КонецЕсли;	
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Адресат") Тогда
		Элементы.Адресат.Видимость = Ложь;
		Адресат = Параметры.Отбор.Адресат;
	КонецЕсли;	
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;	
	
	Если Параметры.Свойство("ЭтоПредставлениеВСВД") Тогда
		ЭтоПредставлениеВСВД = Параметры.ЭтоПредставлениеВСВД;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ЭтоПредставлениеВСВД Тогда
		
		Отказ = Истина;
		
		ЗначенияЗаполненияПараметр = Новый Структура("Адресат", Адресат);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, Заголовок, ЭтоПредставлениеВСВД", 
			ЗначенияЗаполненияПараметр, Заголовок, ЭтоПредставлениеВСВД);
		ОткрытьФорму("РегистрСведений.УчастникиСВД.ФормаЗаписи", ПараметрыФормы);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлюч(Адресат, Транспорт)
	
	ПараметрыКлюча = Новый Структура("Адресат, Транспорт", 
		Адресат, Транспорт);
	Ключ = РегистрыСведений.УчастникиСВД.СоздатьКлючЗаписи(ПараметрыКлюча);
	Возврат Ключ;
	
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтоПредставлениеВСВД Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Ключ = ПолучитьКлюч(Элементы.Список.ТекущиеДанные.Адресат, Элементы.Список.ТекущиеДанные.Транспорт);
		ПараметрыФормы = Новый Структура("Ключ, ЭтоПредставлениеВСВД", Ключ, ЭтоПредставлениеВСВД);
		
		ПараметрыФормы.Вставить("Заголовок", Заголовок);
		
		ОткрытьФорму("РегистрСведений.УчастникиСВД.ФормаЗаписи", ПараметрыФормы);
		
	КонецЕсли;	

КонецПроцедуры
